// А теперь пишем в слепую!

#include <iostream>

int main()
{
    // Выводим первую строку и добавляем символ переноса строки
    std::cout << "О, сколько нам открытий чудных\n";

    // Выводим вторую строку и добавляем символ переноса строки
    std::cout << "Готовит просвещенья дух,\n";

    // Выводим третью строку и добавляем символ переноса строки
    std::cout << "И опыт, сын ошибок трудных,\n";

    // Выводим последнюю строку без символа переноса строки
    std::cout << "И гений, парадоксов друг,";

    return 0;
}