// Напишите программу, которая суммирует два введенных числа

#include <iostream>

int main() {
    int a, b;
    std::cin >> a >> b;
    std::cout << (a + b) << std::endl;
    return 0;
}